CREATE TYPE user_status AS ENUM (
  'АКТИВЕН',
  'НЕАКТИВЕН'
);

CREATE TYPE VKR_status AS ENUM (
  'В_ПРОЦЕССЕ',
  'НА_ПРОВЕРКЕ',
  'ОДОБРЕНА',
  'АРХИВ'
);

CREATE TYPE stage_status AS ENUM (
  'ЗАВЕРШЕН',
  'НЕ_ЗАВЕРШЕН'
);

CREATE TYPE check_type AS ENUM (
  'МГНОВЕННАЯ',
  'ПРОВЕРКА_AI',
  'ПРОВЕРКА_ПРЕПОДАВАТЕЛЕМ',
  'ПРОВЕРКА_НОРМОКОНТРОЛЕМ'
);

CREATE TYPE check_status AS ENUM (
  'ПРОЙДЕНА',
  'НЕ_ПРОЙДЕНА',
  'ОЖИДАЕТСЯ',
  'В_ПРОЦЕССЕ',
  'ТРЕБУЕТСЯ_ДОРАБОТКА'
);

CREATE TYPE notification_type AS ENUM (
    'ЭТАП_СДАН',
    'ЭТАП_ВОЗВРАЩЕН',
    'ЭТАП_ПРИНЯТ',
    'ПРОВЕРКА_НАЧАТА',
    'ПРОВЕРКА_НЕ_ПРОЙДЕНА',
    'ПРОВЕРКА_ПРОЙДЕНА',
    'НОВЫЙ_КОММЕНТАРИЙ',
    'ФАЙЛ_ЗАГРУЖЕН',
    'ФАЙЛ_НЕ_ЗАГРУЖЕН',
    'РЕСУРС_ОПУБЛИКОВАН',
    'ТЕМА_ВКР_ОПУБЛИКОВАНА'
);

CREATE TYPE topic_status AS ENUM (
    'ДОСТУПНА',
    'ЗАКРЕПЛЕНА',
    'ЗАКРЫТА'
);

CREATE TYPE resource_category AS ENUM (
    'ГОСТ',
    'МЕТОДИЧЕСКИЕ_МАТЕРИАЛЫ',
    'ШАБЛОНЫ',
    'ДРУГОЕ'
);

CREATE TYPE education_level AS ENUM (
	'бакалавриат',
	'магистратура',
	'аспирантура',
	'специалитет'
);
